---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetSpecificationGroup(System.Int32)
source: html/b3c66f8d-7aa8-ad2c-bfeb-6e69b7eb12b5.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetSpecificationGroup Method

Gets the specification group from its identifier.

## Syntax (C#)
```csharp
public string GetSpecificationGroup(
	int specId
)
```

## Parameters
- **specId** (`System.Int32`) - The specification identifier.

## Returns
The specification group.